In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([[2,3,4],[25,6,7]])

In [3]:
df

    0  1  2
0   2  3  4
1  25  6  7

In [4]:
ass =pd.DataFrame([[2,3,4,4],[12,3,21,3]],columns =["A","B","C","D"],index=["1","2"])

In [5]:
ass

    A  B   C  D
1   2  3   4  4
2  12  3  21  3

In [6]:
ass.head(3)

    A  B   C  D
1   2  3   4  4
2  12  3  21  3

In [7]:
ass.tail(2)

    A  B   C  D
1   2  3   4  4
2  12  3  21  3

In [8]:
ass.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [9]:
ass.index

Index(['1', '2'], dtype='object')

In [10]:
ass

    A  B   C  D
1   2  3   4  4
2  12  3  21  3

In [11]:
ass.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 1 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      int64
 1   B       2 non-null      int64
 2   C       2 non-null      int64
 3   D       2 non-null      int64
dtypes: int64(4)
memory usage: 80.0+ bytes

In [12]:
ass.describe()

               A    B          C         D
count   2.000000  2.0   2.000000  2.000000
mean    7.000000  3.0  12.500000  3.500000
std     7.071068  0.0  12.020815  0.707107
min     2.000000  3.0   4.000000  3.000000
25%     4.500000  3.0   8.250000  3.250000
50%     7.000000  3.0  12.500000  3.500000
75%     9.500000  3.0  16.750000  3.750000
max    12.000000  3.0  21.000000  4.000000

In [13]:
ass

    A  B   C  D
1   2  3   4  4
2  12  3  21  3

In [14]:
ass.nunique()

A    2
B    1
C    2
D    2
dtype: int64

In [15]:
ass.shape

(2, 4)

In [16]:
ass.size

8

In [17]:
#Loading files from the csv

In [18]:
ds= pd.read_csv("https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/warmup-data/coffee.csv")

In [19]:
ds

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [20]:
ds.columns

Index(['Day', 'Coffee Type', 'Units Sold'], dtype='object')

In [21]:
ds.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [22]:
ds.tail(1)

       Day Coffee Type  Units Sold
13  Sunday       Latte          35

In [23]:
ds.index

RangeIndex(start=0, stop=14, step=1)

In [24]:
ds.sample(3)

         Day Coffee Type  Units Sold
12    Sunday    Espresso          45
6   Thursday    Espresso          40
10  Saturday    Espresso          45

In [25]:
#loc and iloc functiosn

In [26]:
#loc syntax is data.loc[rows,columns]

In [27]:
ds.loc[[1,2,3]]

       Day Coffee Type  Units Sold
1   Monday       Latte          15
2  Tuesday    Espresso          30
3  Tuesday       Latte          20

In [28]:
ds

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [29]:
ds.loc[2:6]

         Day Coffee Type  Units Sold
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35
5  Wednesday       Latte          25
6   Thursday    Espresso          40

In [30]:
ds.columns

Index(['Day', 'Coffee Type', 'Units Sold'], dtype='object')

In [31]:
ds.loc[:,["Units Sold"]]

    Units Sold
0           25
1           15
2           30
3           20
4           35
5           25
6           40
7           30
8           45
9           35
10          45
11          35
12          45
13          35

#iloc is simpler as it takes the indexing values only

In [32]:
ds

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [33]:
ds.iloc[1:4,[2,1]]

   Units Sold Coffee Type
1          15       Latte
2          30    Espresso
3          20       Latte

In [34]:
ds.index=ds["Day"]

In [35]:
ds

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25
Thursday    Thursday    Espresso          40
Thursday    Thursday       Latte          30
Friday        Friday    Espresso          45
Friday        Friday       Latte          35
Saturday    Saturday    Espresso          45
Saturday    Saturday       Latte          35
Sunday        Sunday    Espresso          45
Sunday        Sunday       Latte          35

In [36]:
ds.loc[["Monday"],["Day"]]

           Day
Day
Monday  Monday
Monday  Monday

In [37]:
#setting the specific value in the table:

In [38]:
ds= pd.read_csv("https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/warmup-data/coffee.csv")

In [39]:
ds

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [40]:
ds.iloc[[1],[2]]=100

In [41]:
ds.head(5)

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte         100
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [42]:
ds.loc[[2],["Units Sold"]]=95

In [43]:
ds.head(5)

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte         100
2    Tuesday    Espresso          95
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [44]:
ds.loc[0:5,["units Sold"]]=45

In [45]:
ds.head(5)

         Day Coffee Type  Units Sold  units Sold
0     Monday    Espresso          25        45.0
1     Monday       Latte         100        45.0
2    Tuesday    Espresso          95        45.0
3    Tuesday       Latte          20        45.0
4  Wednesday    Espresso          35        45.0

#accessing the specifc data 23:00 keith Gallie

In [46]:
ds

          Day Coffee Type  Units Sold  units Sold
0      Monday    Espresso          25        45.0
1      Monday       Latte         100        45.0
2     Tuesday    Espresso          95        45.0
3     Tuesday       Latte          20        45.0
4   Wednesday    Espresso          35        45.0
5   Wednesday       Latte          25        45.0
6    Thursday    Espresso          40         NaN
7    Thursday       Latte          30         NaN
8      Friday    Espresso          45         NaN
9      Friday       Latte          35         NaN
10   Saturday    Espresso          45         NaN
11   Saturday       Latte          35         NaN
12     Sunday    Espresso          45         NaN
13     Sunday       Latte          35         NaN

In [47]:
ds.Day

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [48]:
ds["Day"]

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [49]:
ds

          Day Coffee Type  Units Sold  units Sold
0      Monday    Espresso          25        45.0
1      Monday       Latte         100        45.0
2     Tuesday    Espresso          95        45.0
3     Tuesday       Latte          20        45.0
4   Wednesday    Espresso          35        45.0
5   Wednesday       Latte          25        45.0
6    Thursday    Espresso          40         NaN
7    Thursday       Latte          30         NaN
8      Friday    Espresso          45         NaN
9      Friday       Latte          35         NaN
10   Saturday    Espresso          45         NaN
11   Saturday       Latte          35         NaN
12     Sunday    Espresso          45         NaN
13     Sunday       Latte          35         NaN

In [50]:
ds.sort_values(["Units Sold","Coffee Type"],ascending =[0,1])

          Day Coffee Type  Units Sold  units Sold
1      Monday       Latte         100        45.0
2     Tuesday    Espresso          95        45.0
8      Friday    Espresso          45         NaN
10   Saturday    Espresso          45         NaN
12     Sunday    Espresso          45         NaN
6    Thursday    Espresso          40         NaN
4   Wednesday    Espresso          35        45.0
9      Friday       Latte          35         NaN
11   Saturday       Latte          35         NaN
13     Sunday       Latte          35         NaN
7    Thursday       Latte          30         NaN
0      Monday    Espresso          25        45.0
5   Wednesday       Latte          25        45.0
3     Tuesday       Latte          20        45.0

In [51]:
for i ,j in ds.iterrows():
    print(i)
    print(j)
    print(" ")

0
Day              Monday
Coffee Type    Espresso
Units Sold           25
units Sold         45.0
Name: 0, dtype: object

1
Day            Monday
Coffee Type     Latte
Units Sold        100
units Sold       45.0
Name: 1, dtype: object

2
Day             Tuesday
Coffee Type    Espresso
Units Sold           95
units Sold         45.0
Name: 2, dtype: object

3
Day            Tuesday
Coffee Type      Latte
Units Sold          20
units Sold        45.0
Name: 3, dtype: object

4
Day            Wednesday
Coffee Type     Espresso
Units Sold            35
units Sold          45.0
Name: 4, dtype: object

5
Day            Wednesday
Coffee Type        Latte
Units Sold            25
units Sold          45.0
Name: 5, dtype: object

6
Day            Thursday
Coffee Type    Espresso
Units Sold           40
units Sold          NaN
Name: 6, dtype: object

7
Day            Thursday
Coffee Type       Latte
Units Sold           30
units Sold          NaN
Name: 7, dtype: object

8
Day              Friday
Coffee Type    Espresso
Units Sold           45
units Sold          NaN
Name: 8, dtype: object

9
Day            Friday
Coffee Type     Latte
Units Sold         35
units Sold        NaN
Name: 9, dtype: object

10
Day            Saturday
Coffee Type    Espresso
Units Sold           45
units Sold          NaN
Name: 10, dtype: object

11
Day            Saturday
Coffee Type       Latte
Units Sold           35
units Sold          NaN
Name: 11, dtype: object

12
Day              Sunday
Coffee Type    Espresso
Units Sold           45
units Sold          NaN
Name: 12, dtype: object

13
Day            Sunday
Coffee Type     Latte
Units Sold         35
units Sold        NaN
Name: 13, dtype: object

#filerting data

In [ ]:
df = pd.read_excel('olyd.xlsx')

In [ ]:
df.head(2)

In [ ]:
df.index

In [ ]:
df.columns

In [ ]:
df.tail(3)

In [ ]:
df.info()

#we filter the rows based on the conditions and display the columns

In [ ]:
df.loc[df['weight_kg'] > 150,['name']]

#short hand filtering is

In [ ]:
filtered= df.loc[(df['height_cm']) > 190 & (df['weight_kg']> 200),['name','NOC']]

In [ ]:
filtered.head(3)

#filtering the strings

In [ ]:
df[df['name'].str.contains('keith', case=False,na =False)]

In [ ]:
 df[df['name'].str.contains('^[AEIOUaeiou]', regex=True, na=False)]

In [ ]:
df[(df['height_cm']>180) & (df['weight_kg']>187)  ]

In [ ]:
ds.shape

In [69]:
df[df['weight_kg']>187]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
59204,59630,Marek Galiski,1951-05-13,Wrocaw,Dolnolskie,POL,Poland,200.0,190.0,1999-09-28
105715,106771,Aythami Ruano,1977-06-18,Las Palmas de Gran Canaria,Las Palmas,ESP,Spain,200.0,198.0,NaN

In [70]:
df[df['name'].str.contains('keith',case= False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
...,...,...,...,...,...,...,...,...,...,...
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN
117676,119195,Duncan Keith,1983-07-16,Winnipeg,Manitoba,CAN,Canada,185.0,88.0,NaN
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN
127310,129749,Tracy Keith-Matchitt,1990-03-30,Palmerston North,Manawatu-Wanganui,NZL,Cook Islands,167.0,60.0,NaN

**add or remove rowds or columns**

In [71]:
df2=df.sample(10)

In [72]:
df2.size

100

In [73]:
df2.shape

(10, 10)

In [74]:
ds

          Day Coffee Type  Units Sold  units Sold
0      Monday    Espresso          25        45.0
1      Monday       Latte         100        45.0
2     Tuesday    Espresso          95        45.0
3     Tuesday       Latte          20        45.0
4   Wednesday    Espresso          35        45.0
5   Wednesday       Latte          25        45.0
6    Thursday    Espresso          40         NaN
7    Thursday       Latte          30         NaN
8      Friday    Espresso          45         NaN
9      Friday       Latte          35         NaN
10   Saturday    Espresso          45         NaN
11   Saturday       Latte          35         NaN
12     Sunday    Espresso          45         NaN
13     Sunday       Latte          35         NaN

In [75]:
ds["price"]=4.77

In [76]:
ds

          Day Coffee Type  Units Sold  units Sold  price
0      Monday    Espresso          25        45.0   4.77
1      Monday       Latte         100        45.0   4.77
2     Tuesday    Espresso          95        45.0   4.77
3     Tuesday       Latte          20        45.0   4.77
4   Wednesday    Espresso          35        45.0   4.77
5   Wednesday       Latte          25        45.0   4.77
6    Thursday    Espresso          40         NaN   4.77
7    Thursday       Latte          30         NaN   4.77
8      Friday    Espresso          45         NaN   4.77
9      Friday       Latte          35         NaN   4.77
10   Saturday    Espresso          45         NaN   4.77
11   Saturday       Latte          35         NaN   4.77
12     Sunday    Espresso          45         NaN   4.77
13     Sunday       Latte          35         NaN   4.77

In [77]:
import numpy as np

**to drop any row use .drop(index_number)**

In [82]:
ds.drop(0)

          Day Coffee Type  Units Sold  units Sold  price
1      Monday       Latte         100        45.0   7.99
2     Tuesday    Espresso          95        45.0   7.99
3     Tuesday       Latte          20        45.0   7.99
4   Wednesday    Espresso          35        45.0   7.99
5   Wednesday       Latte          25        45.0   7.99
6    Thursday    Espresso          40         NaN   7.99
7    Thursday       Latte          30         NaN   7.99
8      Friday    Espresso          45         NaN   7.99
9      Friday       Latte          35         NaN   7.99
10   Saturday    Espresso          45         NaN   7.99
11   Saturday       Latte          35         NaN   7.99
12     Sunday    Espresso          45         NaN   4.33
13     Sunday       Latte          35         NaN   4.33

In [84]:
ds.drop(columns=['price'])

          Day Coffee Type  Units Sold  units Sold
0      Monday    Espresso          25        45.0
1      Monday       Latte         100        45.0
2     Tuesday    Espresso          95        45.0
3     Tuesday       Latte          20        45.0
4   Wednesday    Espresso          35        45.0
5   Wednesday       Latte          25        45.0
6    Thursday    Espresso          40         NaN
7    Thursday       Latte          30         NaN
8      Friday    Espresso          45         NaN
9      Friday       Latte          35         NaN
10   Saturday    Espresso          45         NaN
11   Saturday       Latte          35         NaN
12     Sunday    Espresso          45         NaN
13     Sunday       Latte          35         NaN

In [85]:
ds

          Day Coffee Type  Units Sold  units Sold  price
0      Monday    Espresso          25        45.0   7.99
1      Monday       Latte         100        45.0   7.99
2     Tuesday    Espresso          95        45.0   7.99
3     Tuesday       Latte          20        45.0   7.99
4   Wednesday    Espresso          35        45.0   7.99
5   Wednesday       Latte          25        45.0   7.99
6    Thursday    Espresso          40         NaN   7.99
7    Thursday       Latte          30         NaN   7.99
8      Friday    Espresso          45         NaN   7.99
9      Friday       Latte          35         NaN   7.99
10   Saturday    Espresso          45         NaN   7.99
11   Saturday       Latte          35         NaN   7.99
12     Sunday    Espresso          45         NaN   4.33
13     Sunday       Latte          35         NaN   4.33

In [86]:
ds.drop(columns=['price'],inplace=True)

In [87]:
ds

          Day Coffee Type  Units Sold  units Sold
0      Monday    Espresso          25        45.0
1      Monday       Latte         100        45.0
2     Tuesday    Espresso          95        45.0
3     Tuesday       Latte          20        45.0
4   Wednesday    Espresso          35        45.0
5   Wednesday       Latte          25        45.0
6    Thursday    Espresso          40         NaN
7    Thursday       Latte          30         NaN
8      Friday    Espresso          45         NaN
9      Friday       Latte          35         NaN
10   Saturday    Espresso          45         NaN
11   Saturday       Latte          35         NaN
12     Sunday    Espresso          45         NaN
13     Sunday       Latte          35         NaN

In [88]:
ds.drop(0,inplace=True)

In [89]:
ds

          Day Coffee Type  Units Sold  units Sold
1      Monday       Latte         100        45.0
2     Tuesday    Espresso          95        45.0
3     Tuesday       Latte          20        45.0
4   Wednesday    Espresso          35        45.0
5   Wednesday       Latte          25        45.0
6    Thursday    Espresso          40         NaN
7    Thursday       Latte          30         NaN
8      Friday    Espresso          45         NaN
9      Friday       Latte          35         NaN
10   Saturday    Espresso          45         NaN
11   Saturday       Latte          35         NaN
12     Sunday    Espresso          45         NaN
13     Sunday       Latte          35         NaN

In [92]:
ds= pd.read_csv('https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/warmup-data/coffee.csv')

In [93]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     object
 1   Coffee Type  14 non-null     object
 2   Units Sold   14 non-null     int64
dtypes: int64(1), object(2)
memory usage: 468.0+ bytes

In [96]:
ds

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [97]:
ds.drop(0,inplace=True)

In [98]:
ds

          Day Coffee Type  Units Sold
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [99]:
ds_new=ds

In [100]:
ds_new

          Day Coffee Type  Units Sold
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [101]:
ds['price']=5.99

In [102]:
ds

          Day Coffee Type  Units Sold  price
1      Monday       Latte          15   5.99
2     Tuesday    Espresso          30   5.99
3     Tuesday       Latte          20   5.99
4   Wednesday    Espresso          35   5.99
5   Wednesday       Latte          25   5.99
6    Thursday    Espresso          40   5.99
7    Thursday       Latte          30   5.99
8      Friday    Espresso          45   5.99
9      Friday       Latte          35   5.99
10   Saturday    Espresso          45   5.99
11   Saturday       Latte          35   5.99
12     Sunday    Espresso          45   5.99
13     Sunday       Latte          35   5.99

In [103]:
ds["revenue"]=ds["Units Sold"] * ds["price"]

In [104]:
ds

          Day Coffee Type  Units Sold  price  revenue
1      Monday       Latte          15   5.99    89.85
2     Tuesday    Espresso          30   5.99   179.70
3     Tuesday       Latte          20   5.99   119.80
4   Wednesday    Espresso          35   5.99   209.65
5   Wednesday       Latte          25   5.99   149.75
6    Thursday    Espresso          40   5.99   239.60
7    Thursday       Latte          30   5.99   179.70
8      Friday    Espresso          45   5.99   269.55
9      Friday       Latte          35   5.99   209.65
10   Saturday    Espresso          45   5.99   269.55
11   Saturday       Latte          35   5.99   209.65
12     Sunday    Espresso          45   5.99   269.55
13     Sunday       Latte          35   5.99   209.65

In [105]:
ds["tax"]= ds['revenue'] %13

In [106]:
ds

          Day Coffee Type  Units Sold  price  revenue    tax
1      Monday       Latte          15   5.99    89.85  11.85
2     Tuesday    Espresso          30   5.99   179.70  10.70
3     Tuesday       Latte          20   5.99   119.80   2.80
4   Wednesday    Espresso          35   5.99   209.65   1.65
5   Wednesday       Latte          25   5.99   149.75   6.75
6    Thursday    Espresso          40   5.99   239.60   5.60
7    Thursday       Latte          30   5.99   179.70  10.70
8      Friday    Espresso          45   5.99   269.55   9.55
9      Friday       Latte          35   5.99   209.65   1.65
10   Saturday    Espresso          45   5.99   269.55   9.55
11   Saturday       Latte          35   5.99   209.65   1.65
12     Sunday    Espresso          45   5.99   269.55   9.55
13     Sunday       Latte          35   5.99   209.65   1.65

In [107]:
ds=ds.rename(columns={'price':'Price'

SyntaxError: invalid syntax (1440499522.py, line 1)